###################################################################

# Created by write_sdc on Wed Nov 7 16:46:13 2018

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_area 0
set_load -pin_load 50 [get_ports {HADDR[31]}]
set_load -pin_load 50 [get_ports {HADDR[30]}]
set_load -pin_load 50 [get_ports {HADDR[29]}]
set_load -pin_load 50 [get_ports {HADDR[28]}]
set_load -pin_load 50 [get_ports {HADDR[27]}]
set_load -pin_load 50 [get_ports {HADDR[26]}]
set_load -pin_load 50 [get_ports {HADDR[25]}]
set_load -pin_load 50 [get_ports {HADDR[24]}]
set_load -pin_load 50 [get_ports {HADDR[23]}]
set_load -pin_load 50 [get_ports {HADDR[22]}]
set_load -pin_load 50 [get_ports {HADDR[21]}]
set_load -pin_load 50 [get_ports {HADDR[20]}]
set_load -pin_load 50 [get_ports {HADDR[19]}]
set_load -pin_load 50 [get_ports {HADDR[18]}]
set_load -pin_load 50 [get_ports {HADDR[17]}]
set_load -pin_load 50 [get_ports {HADDR[16]}]
set_load -pin_load 50 [get_ports {HADDR[15]}]
set_load -pin_load 50 [get_ports {HADDR[14]}]
set_load -pin_load 50 [get_ports {HADDR[13]}]
set_load -pin_load 50 [get_ports {HADDR[12]}]
set_load -pin_load 50 [get_ports {HADDR[11]}]
set_load -pin_load 50 [get_ports {HADDR[10]}]
set_load -pin_load 50 [get_ports {HADDR[9]}]
set_load -pin_load 50 [get_ports {HADDR[8]}]
set_load -pin_load 50 [get_ports {HADDR[7]}]
set_load -pin_load 50 [get_ports {HADDR[6]}]
set_load -pin_load 50 [get_ports {HADDR[5]}]
set_load -pin_load 50 [get_ports {HADDR[4]}]
set_load -pin_load 50 [get_ports {HADDR[3]}]
set_load -pin_load 50 [get_ports {HADDR[2]}]
set_load -pin_load 50 [get_ports {HADDR[1]}]
set_load -pin_load 50 [get_ports {HADDR[0]}]
set_load -pin_load 50 [get_ports {HBURST[2]}]
set_load -pin_load 50 [get_ports {HBURST[1]}]
set_load -pin_load 50 [get_ports {HBURST[0]}]
set_load -pin_load 50 [get_ports HMASTLOCK]
set_load -pin_load 50 [get_ports {HPROT[3]}]
set_load -pin_load 50 [get_ports {HPROT[2]}]
set_load -pin_load 50 [get_ports {HPROT[1]}]
set_load -pin_load 50 [get_ports {HPROT[0]}]
set_load -pin_load 50 [get_ports {HSIZE[2]}]
set_load -pin_load 50 [get_ports {HSIZE[1]}]
set_load -pin_load 50 [get_ports {HSIZE[0]}]
set_load -pin_load 50 [get_ports {HTRANS[1]}]
set_load -pin_load 50 [get_ports {HTRANS[0]}]
set_load -pin_load 50 [get_ports {HWDATA[31]}]
set_load -pin_load 50 [get_ports {HWDATA[30]}]
set_load -pin_load 50 [get_ports {HWDATA[29]}]
set_load -pin_load 50 [get_ports {HWDATA[28]}]
set_load -pin_load 50 [get_ports {HWDATA[27]}]
set_load -pin_load 50 [get_ports {HWDATA[26]}]
set_load -pin_load 50 [get_ports {HWDATA[25]}]
set_load -pin_load 50 [get_ports {HWDATA[24]}]
set_load -pin_load 50 [get_ports {HWDATA[23]}]
set_load -pin_load 50 [get_ports {HWDATA[22]}]
set_load -pin_load 50 [get_ports {HWDATA[21]}]
set_load -pin_load 50 [get_ports {HWDATA[20]}]
set_load -pin_load 50 [get_ports {HWDATA[19]}]
set_load -pin_load 50 [get_ports {HWDATA[18]}]
set_load -pin_load 50 [get_ports {HWDATA[17]}]
set_load -pin_load 50 [get_ports {HWDATA[16]}]
set_load -pin_load 50 [get_ports {HWDATA[15]}]
set_load -pin_load 50 [get_ports {HWDATA[14]}]
set_load -pin_load 50 [get_ports {HWDATA[13]}]
set_load -pin_load 50 [get_ports {HWDATA[12]}]
set_load -pin_load 50 [get_ports {HWDATA[11]}]
set_load -pin_load 50 [get_ports {HWDATA[10]}]
set_load -pin_load 50 [get_ports {HWDATA[9]}]
set_load -pin_load 50 [get_ports {HWDATA[8]}]
set_load -pin_load 50 [get_ports {HWDATA[7]}]
set_load -pin_load 50 [get_ports {HWDATA[6]}]
set_load -pin_load 50 [get_ports {HWDATA[5]}]
set_load -pin_load 50 [get_ports {HWDATA[4]}]
set_load -pin_load 50 [get_ports {HWDATA[3]}]
set_load -pin_load 50 [get_ports {HWDATA[2]}]
set_load -pin_load 50 [get_ports {HWDATA[1]}]
set_load -pin_load 50 [get_ports {HWDATA[0]}]
set_load -pin_load 50 [get_ports HWRITE]
set_load -pin_load 50 [get_ports HMASTER]
set_load -pin_load 50 [get_ports CODENSEQ]
set_load -pin_load 50 [get_ports {CODEHINTDE[2]}]
set_load -pin_load 50 [get_ports {CODEHINTDE[1]}]
set_load -pin_load 50 [get_ports {CODEHINTDE[0]}]
set_load -pin_load 50 [get_ports SPECHTRANS]
set_load -pin_load 50 [get_ports SWDO]
set_load -pin_load 50 [get_ports SWDOEN]
set_load -pin_load 50 [get_ports TDO]
set_load -pin_load 50 [get_ports nTDOEN]
set_load -pin_load 50 [get_ports DBGRESTARTED]
set_load -pin_load 50 [get_ports HALTED]
set_load -pin_load 50 [get_ports TXEV]
set_load -pin_load 50 [get_ports LOCKUP]
set_load -pin_load 50 [get_ports SYSRESETREQ]
set_load -pin_load 50 [get_ports GATEHCLK]
set_load -pin_load 50 [get_ports SLEEPING]
set_load -pin_load 50 [get_ports SLEEPDEEP]
set_load -pin_load 50 [get_ports WAKEUP]
set_load -pin_load 50 [get_ports {WICSENSE[33]}]
set_load -pin_load 50 [get_ports {WICSENSE[32]}]
set_load -pin_load 50 [get_ports {WICSENSE[31]}]
set_load -pin_load 50 [get_ports {WICSENSE[30]}]
set_load -pin_load 50 [get_ports {WICSENSE[29]}]
set_load -pin_load 50 [get_ports {WICSENSE[28]}]
set_load -pin_load 50 [get_ports {WICSENSE[27]}]
set_load -pin_load 50 [get_ports {WICSENSE[26]}]
set_load -pin_load 50 [get_ports {WICSENSE[25]}]
set_load -pin_load 50 [get_ports {WICSENSE[24]}]
set_load -pin_load 50 [get_ports {WICSENSE[23]}]
set_load -pin_load 50 [get_ports {WICSENSE[22]}]
set_load -pin_load 50 [get_ports {WICSENSE[21]}]
set_load -pin_load 50 [get_ports {WICSENSE[20]}]
set_load -pin_load 50 [get_ports {WICSENSE[19]}]
set_load -pin_load 50 [get_ports {WICSENSE[18]}]
set_load -pin_load 50 [get_ports {WICSENSE[17]}]
set_load -pin_load 50 [get_ports {WICSENSE[16]}]
set_load -pin_load 50 [get_ports {WICSENSE[15]}]
set_load -pin_load 50 [get_ports {WICSENSE[14]}]
set_load -pin_load 50 [get_ports {WICSENSE[13]}]
set_load -pin_load 50 [get_ports {WICSENSE[12]}]
set_load -pin_load 50 [get_ports {WICSENSE[11]}]
set_load -pin_load 50 [get_ports {WICSENSE[10]}]
set_load -pin_load 50 [get_ports {WICSENSE[9]}]
set_load -pin_load 50 [get_ports {WICSENSE[8]}]
set_load -pin_load 50 [get_ports {WICSENSE[7]}]
set_load -pin_load 50 [get_ports {WICSENSE[6]}]
set_load -pin_load 50 [get_ports {WICSENSE[5]}]
set_load -pin_load 50 [get_ports {WICSENSE[4]}]
set_load -pin_load 50 [get_ports {WICSENSE[3]}]
set_load -pin_load 50 [get_ports {WICSENSE[2]}]
set_load -pin_load 50 [get_ports {WICSENSE[1]}]
set_load -pin_load 50 [get_ports {WICSENSE[0]}]
set_load -pin_load 50 [get_ports SLEEPHOLDACKn]
set_load -pin_load 50 [get_ports WICENACK]
set_load -pin_load 50 [get_ports CDBGPWRUPREQ]
create_clock [get_ports FCLK]  -name REF_FCLK  -period 9  -waveform {0 4}
set_clock_uncertainty -setup 0.1  [get_clocks REF_FCLK]
set_clock_transition -max -rise 0.05 [get_clocks REF_FCLK]
set_clock_transition -max -fall 0.05 [get_clocks REF_FCLK]
set_clock_transition -min -rise 0.05 [get_clocks REF_FCLK]
set_clock_transition -min -fall 0.05 [get_clocks REF_FCLK]
create_clock [get_ports SCLK]  -name REF_SCLK  -period 9  -waveform {0 4}
set_clock_uncertainty -setup 0.1  [get_clocks REF_SCLK]
set_clock_transition -max -rise 0.05 [get_clocks REF_SCLK]
set_clock_transition -max -fall 0.05 [get_clocks REF_SCLK]
set_clock_transition -min -rise 0.05 [get_clocks REF_SCLK]
set_clock_transition -min -fall 0.05 [get_clocks REF_SCLK]
create_clock [get_ports HCLK]  -name REF_HCLK  -period 9  -waveform {0 4}
set_clock_uncertainty -setup 0.1  [get_clocks REF_HCLK]
set_clock_transition -max -rise 0.05 [get_clocks REF_HCLK]
set_clock_transition -max -fall 0.05 [get_clocks REF_HCLK]
set_clock_transition -min -rise 0.05 [get_clocks REF_HCLK]
set_clock_transition -min -fall 0.05 [get_clocks REF_HCLK]
create_clock [get_ports DCLK]  -name REF_DCLK  -period 9  -waveform {0 4}
set_clock_uncertainty -setup 0.1  [get_clocks REF_DCLK]
set_clock_transition -max -rise 0.05 [get_clocks REF_DCLK]
set_clock_transition -max -fall 0.05 [get_clocks REF_DCLK]
set_clock_transition -min -rise 0.05 [get_clocks REF_DCLK]
set_clock_transition -min -fall 0.05 [get_clocks REF_DCLK]
create_clock [get_ports SWCLKTCK]  -name REF_SWCLKTCK  -period 9  -waveform {0 4}
set_clock_uncertainty -setup 0.1  [get_clocks REF_SWCLKTCK]
set_clock_transition -max -rise 0.05 [get_clocks REF_SWCLKTCK]
set_clock_transition -max -fall 0.05 [get_clocks REF_SWCLKTCK]
set_clock_transition -min -rise 0.05 [get_clocks REF_SWCLKTCK]
set_clock_transition -min -fall 0.05 [get_clocks REF_SWCLKTCK]
set_input_delay -clock REF_FCLK  1.8  [get_ports FCLK]
set_input_delay -clock REF_FCLK  1.8  [get_ports SCLK]
set_input_delay -clock REF_FCLK  1.8  [get_ports HCLK]
set_input_delay -clock REF_FCLK  1.8  [get_ports DCLK]
set_input_delay -clock REF_FCLK  1.8  [get_ports SWCLKTCK]
set_input_delay -clock REF_FCLK  1.8  [get_ports PORESETn]
set_input_delay -clock REF_FCLK  1.8  [get_ports DBGRESETn]
set_input_delay -clock REF_FCLK  1.8  [get_ports HRESETn]
set_input_delay -clock REF_FCLK  1.8  [get_ports nTRST]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[31]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[30]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[29]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[28]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[27]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[26]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[25]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[24]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[23]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[22]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[21]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[20]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[19]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[18]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[17]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[16]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[15]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[14]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[13]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[12]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[11]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[10]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[9]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[8]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[7]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[6]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[5]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[4]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[3]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[2]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[1]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {HRDATA[0]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports HREADY]
set_input_delay -clock REF_FCLK  1.8  [get_ports HRESP]
set_input_delay -clock REF_FCLK  1.8  [get_ports SWDITMS]
set_input_delay -clock REF_FCLK  1.8  [get_ports TDI]
set_input_delay -clock REF_FCLK  1.8  [get_ports DBGRESTART]
set_input_delay -clock REF_FCLK  1.8  [get_ports EDBGRQ]
set_input_delay -clock REF_FCLK  1.8  [get_ports NMI]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[31]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[30]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[29]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[28]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[27]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[26]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[25]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[24]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[23]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[22]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[21]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[20]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[19]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[18]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[17]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[16]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[15]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[14]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[13]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[12]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[11]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[10]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[9]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[8]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[7]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[6]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[5]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[4]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[3]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[2]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[1]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQ[0]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports RXEV]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[25]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[24]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[23]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[22]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[21]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[20]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[19]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[18]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[17]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[16]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[15]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[14]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[13]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[12]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[11]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[10]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[9]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[8]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[7]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[6]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[5]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[4]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[3]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[2]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[1]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {STCALIB[0]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports STCLKEN]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[7]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[6]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[5]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[4]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[3]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[2]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[1]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {IRQLATENCY[0]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[27]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[26]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[25]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[24]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[23]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[22]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[21]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[20]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[19]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[18]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[17]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[16]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[15]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[14]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[13]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[12]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[11]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[10]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[9]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[8]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[7]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[6]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[5]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[4]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[3]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[2]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[1]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports {ECOREVNUM[0]}]
set_input_delay -clock REF_FCLK  1.8  [get_ports SLEEPHOLDREQn]
set_input_delay -clock REF_FCLK  1.8  [get_ports WICENREQ]
set_input_delay -clock REF_FCLK  1.8  [get_ports CDBGPWRUPACK]
set_input_delay -clock REF_FCLK  1.8  [get_ports SE]
set_input_delay -clock REF_FCLK  1.8  [get_ports RSTBYPASS]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[31]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[30]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[29]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[28]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[27]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[26]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[25]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[24]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[23]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[22]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[21]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[20]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[19]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[18]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[17]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[16]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[15]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[14]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[13]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[12]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[11]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[10]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[9]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[8]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[7]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[6]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[5]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[4]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[3]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HADDR[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HBURST[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HBURST[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HBURST[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports HMASTLOCK]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HPROT[3]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HPROT[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HPROT[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HPROT[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HSIZE[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HSIZE[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HSIZE[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HTRANS[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HTRANS[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[31]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[30]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[29]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[28]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[27]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[26]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[25]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[24]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[23]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[22]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[21]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[20]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[19]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[18]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[17]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[16]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[15]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[14]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[13]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[12]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[11]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[10]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[9]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[8]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[7]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[6]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[5]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[4]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[3]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {HWDATA[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports HWRITE]
set_output_delay -clock REF_FCLK  1.8  [get_ports HMASTER]
set_output_delay -clock REF_FCLK  1.8  [get_ports CODENSEQ]
set_output_delay -clock REF_FCLK  1.8  [get_ports {CODEHINTDE[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {CODEHINTDE[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {CODEHINTDE[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports SPECHTRANS]
set_output_delay -clock REF_FCLK  1.8  [get_ports SWDO]
set_output_delay -clock REF_FCLK  1.8  [get_ports SWDOEN]
set_output_delay -clock REF_FCLK  1.8  [get_ports TDO]
set_output_delay -clock REF_FCLK  1.8  [get_ports nTDOEN]
set_output_delay -clock REF_FCLK  1.8  [get_ports DBGRESTARTED]
set_output_delay -clock REF_FCLK  1.8  [get_ports HALTED]
set_output_delay -clock REF_FCLK  1.8  [get_ports TXEV]
set_output_delay -clock REF_FCLK  1.8  [get_ports LOCKUP]
set_output_delay -clock REF_FCLK  1.8  [get_ports SYSRESETREQ]
set_output_delay -clock REF_FCLK  1.8  [get_ports GATEHCLK]
set_output_delay -clock REF_FCLK  1.8  [get_ports SLEEPING]
set_output_delay -clock REF_FCLK  1.8  [get_ports SLEEPDEEP]
set_output_delay -clock REF_FCLK  1.8  [get_ports WAKEUP]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[33]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[32]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[31]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[30]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[29]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[28]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[27]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[26]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[25]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[24]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[23]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[22]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[21]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[20]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[19]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[18]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[17]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[16]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[15]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[14]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[13]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[12]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[11]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[10]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[9]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[8]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[7]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[6]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[5]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[4]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[3]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[2]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[1]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports {WICSENSE[0]}]
set_output_delay -clock REF_FCLK  1.8  [get_ports SLEEPHOLDACKn]
set_output_delay -clock REF_FCLK  1.8  [get_ports WICENACK]
set_output_delay -clock REF_FCLK  1.8  [get_ports CDBGPWRUPREQ]
