
####################################################################################
# Constraints
# ----------------------------------------------------------------------------
#
# 0. Design Compiler variables
#
# 1. Master Clock Definitions
#
# 2. Generated Clock Definitions
#
# 3. Clock Uncertainties
#
# 4. Clock Latencies 
#
# 5. Clock Relationships
#
# 6. set input/output delay on ports
#
# 7. Driving cells
#
# 8. Output load

####################################################################################
           #########################################################
                  #### Section 0 : DC Variables ####
           #########################################################
#################################################################################### 

# Prevent assign statements in the generated netlist (must be applied before compile command)
set_fix_multiple_port_nets -all -buffer_constants -feedthroughs

####################################################################################
           #########################################################
                  #### Section 1 : Clock Definition ####
           #########################################################
#################################################################################### 
# 1. Master Clock Definitions 
# 2. Generated Clock Definitions
# 3. Clock Latencies
# 4. Clock Uncertainties
# 4. Clock Transitions
####################################################################################

# REF CLOCK (50 MHz)
#set CLK1_NAME REF_CLK
set CLK1_NAME REF_FCLK
set CLK2_NAME REF_SCLK
set CLK3_NAME REF_HCLK
set CLK4_NAME REF_DCLK
set CLK5_NAME REF_SWCLKTCK
set CLK1_PER 9

# Skew
set CLK_SETUP_SKEW 0.1
set CLK_HOLD_SKEW 0.05

set CLK_TRANSTION 0.05
#1. Master Clocks

create_clock -name $CLK1_NAME -period $CLK1_PER -waveform "0 [expr $CLK1_PER/2]" [get_ports FCLK]
create_clock -name $CLK2_NAME -period $CLK1_PER -waveform "0 [expr $CLK1_PER/2]" [get_ports SCLK]
create_clock -name $CLK3_NAME -period $CLK1_PER -waveform "0 [expr $CLK1_PER/2]" [get_ports HCLK]
create_clock -name $CLK4_NAME -period $CLK1_PER -waveform "0 [expr $CLK1_PER/2]" [get_ports DCLK]
create_clock -name $CLK5_NAME -period $CLK1_PER -waveform "0 [expr $CLK1_PER/2]" [get_ports SWCLKTCK]

set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK1_NAME]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK2_NAME]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK3_NAME]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK4_NAME]
set_clock_uncertainty -setup $CLK_SETUP_SKEW [get_clocks $CLK5_NAME]

set_clock_transition $CLK_TRANSTION [get_clocks $CLK1_NAME]
set_clock_transition $CLK_TRANSTION [get_clocks $CLK2_NAME]
set_clock_transition $CLK_TRANSTION [get_clocks $CLK3_NAME]
set_clock_transition $CLK_TRANSTION [get_clocks $CLK4_NAME]
set_clock_transition $CLK_TRANSTION [get_clocks $CLK5_NAME]

####################################################################################
           #########################################################
             #### Section 3 : set input/output delay on ports ####
           #########################################################
####################################################################################

set in_delay  [expr 0.2*$CLK1_PER]
set out_delay [expr 0.2*$CLK1_PER]

#Constrain Input Paths
set_input_delay $in_delay -clock $CLK1_NAME [remove_from_collection [all_inputs] clk]

#Constrain Output Paths
set_output_delay $out_delay -clock $CLK1_NAME [all_outputs]
#[get_ports PC_Top]

####################################################################################
           #########################################################
                  #### Section 4 : Driving cells ####
           #########################################################
####################################################################################

set_driving_cell -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c -lib_cell BUFX2M -pin Y [remove_from_collection [all_inputs] clk ]

####################################################################################
           #########################################################
                  #### Section 5 : Output load ####
           #########################################################
####################################################################################

set_load 50 [all_outputs]
#[get_ports SIMULATIONEND][remove_from_collection [all_outputs] clk ]

####################################################################################
########################## Max_Area ################################################
###################################################################################
set_max_area 0

####################################################################################
           #########################################################
                 #### Section 6 : Operating Condition ####
           #########################################################
####################################################################################

# Define the Worst Library for Max(#setup) analysis
# Define the Best Library for Min(hold) analysis

set_operating_conditions -min_library "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -min "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c" -max_library "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c" -max "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c"

####################################################################################
           #########################################################
                  #### Section 7 : wireload Model ####
           #########################################################
####################################################################################

set_wire_load_model -name tsmc13_wl30 -library scmetro_tsmc_cl013g_rvt_ss_1p08v_125c

####################################################################################


